import Image from 'next/image';

const sampleText = ``;

export default function Product() {
	return (
		<main className="flex flex-col items-center justify-center px-16 pt-8">
			<div className="flex flex-row items-center justify-center gap-12">
				<div className="relative h-[450px] w-[450px] flex-shrink-0 overflow-hidden rounded-xl">
					<Image alt="php logo" src={'/images/php.png'} fill={true} className="object-cover" />
				</div>
				<div className="flex h-[450px] flex-col items-start overflow-hidden px-12 py-4">
					<h1 className="whitespace-nowrap text-3xl font-bold">چت آنلاین PHP</h1>
					<p className="mr-4 mt-4 h-full font-bold">
						در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و
						اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس
						و php ارائه می شود. در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و
						اداری و خبری و اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و
						لاراول و وردپرس و php ارائه می شود. در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و
						شرکتی و مدیریتی و اداری و خبری و اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم ورک های
						مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود. در این بخش از خدمات، سایت های آماده
						فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی ، آماده به فروش می باشد که با زبان
						ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود. در این بخش از خدمات،
						سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی ، آماده به فروش می
						باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود. در این
						بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی ،
						آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php
						ارائه می شود. در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و
						خبری و اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و
						وردپرس و php ارائه می شود. در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و
						مدیریتی و اداری و خبری و اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف
						مانند جنگو و لاراول و وردپرس و php ارائه می شود. در این بخش از خدمات، سایت های آماده فروشگاهی و
						سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم
						ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود. در این بخش از خدمات، سایت های
						آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی ، آماده به فروش می باشد که
						با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود. در این بخش از
						خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی ، آماده به
						فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود.
						در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و
						اختصاصی ، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس
						و php ارائه می شود. در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و
						اداری و خبری و
					</p>
				</div>
			</div>
			<div className="mt-16 flex w-full flex-row items-center justify-between gap-12">
				<div className=" flex h-[300px] w-2/3 flex-row justify-between rounded-xl bg-nahal-green px-16 py-8 text-xl font-bold text-white">
					<div className="flex w-1/2 flex-col gap-4">
						<h1 className="-mr-2 text-2xl">مشخصات</h1>
						<span>نام محصول : چت آنلاین PHP</span>
						<span>تاریخ انتشار : 1402/06/09</span>
						<span>تعداد فروش : 20</span>
						<span>تعداد بازدید : 40</span>
					</div>
					<div className="mt-12 flex w-1/2 flex-col gap-4">
						<span>آخرین بروزرسانی : 1402/07/08</span>
						<span>پشتیبانی : 24 ساعت پس از خرید </span>
					</div>
				</div>
				<div className="flex h-[300px] w-1/3 flex-col items-center justify-between rounded-xl bg-nahal-green p-3 text-xl font-bold text-white">
					<span className="mt-4 text-3xl">3.600.000 تومان</span>
					<div className="flex w-full flex-col items-center justify-center gap-3">
						<button className="w-full rounded-lg bg-[#FFC107] py-2 hover:brightness-110">پیش نمایش</button>
						<button className="w-full rounded-lg bg-[#0D6EFD] py-2 hover:brightness-110">خرید</button>
					</div>
				</div>
			</div>
		</main>
	);
}
